MikroElektronika/core_packages/dsPIC/XC16/def/PIC24F04KA200/mcu.h
#define MCLRE_OFF            0x007B
#define MCLRE_ON             0x00FB

/* Register FICD (0xf8000e)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FICD;
#define _FICD(x) __attribute__((address(0xf8000e),deprecated_definition("consider migrating to #pragma config"),section("__FICD.sec"),space(prog))) __prog__ uint16_t _FICD = (x);

/*
** Only one invocation of FICD should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FICD.
** Multiple options may be combined, as shown:
**
** _FICD( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Reserved:
**     ICS_PGx3             PGC3/PGD3 are used for programming the device
**     ICS_PGx2             PGC2/PGD2 are used for programming the device
**
*/

#define ICS_PGx3             0x00C1
#define ICS_PGx2             0x00C2

/* Register FDS (0xf80010)                               */

extern __attribute__((space(prog))) __prog__ uint16_t _FDS;
#define _FDS(x) __attribute__((address(0xf80010),deprecated_definition("consider migrating to #pragma config"),section("__FDS.sec"),space(prog))) __prog__ uint16_t _FDS = (x);

/*
** Only one invocation of FDS should appear in a project,
** at the top of a C source file (outside of any function).
**
** The following constants can be used to set FDS.
** Multiple options may be combined, as shown:
**
** _FDS( OPT1_ON & OPT2_OFF & OPT3_PLL )
**
**   Deep Sleep Watchdog Timer Postscale Select bits:
**     DSWDTPS_DSWDTPS0     1:2 (2.1 ms)
**     DSWDTPS_DSWDTPS1     1:8 (8.3 ms)
**     DSWDTPS_DSWDTPS2     1:32 (33 ms)
**     DSWDTPS_DSWDTPS3     1:128 (132 ms)
**     DSWDTPS_DSWDTPS4     1:512 (528 ms)
**     DSWDTPS_DSWDTPS5     1:2048 (2.1 Seconds)
**     DSWDTPS_DSWDTPS6     1:8192 (8.5 Seconds)
**     DSWDTPS_DSWDTPS7     1:32,768 (34 Seconds)
**     DSWDTPS_DSWDTPS8     1:131,072 (135 Seconds)
**     DSWDTPS_DSWDTPS9     1:524,288 (9 Minutes)
**     DSWDTPS_DSWDTPSA     1:2,097,152 (36 Minutes)
**     DSWDTPS_DSWDTPSB     1:8,388,608 (2.4 Hours)
**     DSWDTPS_DSWDTPSC     1:33,554,432 (9.6 Hours)
**     DSWDTPS_DSWDTPSD     1:134,217,728 (38.5 Hours)
**     DSWDTPS_DSWDTPSE     1:536,870,912 (6.4 Days)
**     DSWDTPS_DSWDTPSF     1:2,147,483,648 (25.7 Days)
**
**   Deep Sleep Zero-Power BOR Enable bit:
**     DSLPBOR_OFF          Deep Sleep BOR disabled in Deep Sleep
**     DSLPBOR_ON           Deep Sleep BOR enabled in Deep Sleep
**
**   Deep Sleep Watchdog Timer Enable bit:
**     DSWDTEN_OFF          DSWDT disabled
**     DSWDTEN_ON           DSWDT enabled
**
*/

#define DSWDTPS_DSWDTPS0     0x00F0
#define DSWDTPS_DSWDTPS1     0x00F1
#define DSWDTPS_DSWDTPS2     0x00F2
#define DSWDTPS_DSWDTPS3     0x00F3
#define DSWDTPS_DSWDTPS4     0x00F4
#define DSWDTPS_DSWDTPS5     0x00F5
#define DSWDTPS_DSWDTPS6     0x00F6
#define DSWDTPS_DSWDTPS7     0x00F7
#define DSWDTPS_DSWDTPS8     0x00F8
#define DSWDTPS_DSWDTPS9     0x00F9
#define DSWDTPS_DSWDTPSA     0x00FA
#define DSWDTPS_DSWDTPSB     0x00FB
#define DSWDTPS_DSWDTPSC     0x00FC
#define DSWDTPS_DSWDTPSD     0x00FD
#define DSWDTPS_DSWDTPSE     0x00FE
#define DSWDTPS_DSWDTPSF     0x00FF

#define DSLPBOR_OFF          0x00BF
#define DSLPBOR_ON           0x00FF

#define DSWDTEN_OFF          0x007F
#define DSWDTEN_ON           0x00FF



/*
 * Memory Segments Sizes
 */

#define __RESET_BASE 0x0
#define __RESET_LENGTH 0x4

#define __IVT_BASE 0x4
#define __IVT_LENGTH 0xfc

#define ___RESERVED_BASE 0x100
#define ___RESERVED_LENGTH 0x4

#define __AIVT_BASE 0x104
#define __AIVT_LENGTH 0xfc

#define __PROGRAM_BASE 0x200
#define __PROGRAM_LENGTH 0x900

#define __FGS_BASE 0xf80004
#define __FGS_LENGTH 0x2

#define __FOSCSEL_BASE 0xf80006
#define __FOSCSEL_LENGTH 0x2

#define __FOSC_BASE 0xf80008
#define __FOSC_LENGTH 0x2

#define __FWDT_BASE 0xf8000a
#define __FWDT_LENGTH 0x2

#define __FPOR_BASE 0xf8000c
#define __FPOR_LENGTH 0x2

#define __FICD_BASE 0xf8000e
#define __FICD_LENGTH 0x2

#define __FDS_BASE 0xf80010
#define __FDS_LENGTH 0x2

#define __DEVID_BASE 0xff0000
#define __DEVID_LENGTH 0x4

#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x800

#define __DATA_BASE 0x800
#define __DATA_LENGTH 0x200

#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x800

#define __DATA_BASE 0x800
#define __DATA_LENGTH 0x200

#define __SFRS_BASE 0x0
#define __SFRS_LENGTH 0x800

#define __DATA_BASE 0x800
#define __DATA_LENGTH 0x200



#endif
